app/Modules/Authentication_Teacher/Controllers/Authentication_Teacher.php

    public function authenticate()
    {
        $SessionCheck = session()->get('StudentSession');
        if (!empty($SessionCheck)) {
            return redirect()->to(base_url('student_dashboard'));
        }
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $teachers = $this->Authentication_Teacher_Model->where('email', $email)->first();
---
SELECT *
FROM `teachers`
WHERE `email` = 'urmil@gmail.com'
 LIMIT 1